{
    "id": "8e54f19a2c7b2025d2fsdevic",
    "title": "D2FS: Device-Driven Filesystem Garbage Collection",
    "authors": ["Juwon Kim", "Seungjae Lee", "Joontaek Oh", "Dongkun Shin", "Youjip Won"],
    "year": 2025,
    "conference": "FAST",
    "category": "文件系统与存储技术",
    "keywords": ["设备驱动垃圾回收 (Device-Driven Garbage Collection)", "日志结构文件系统 (Log-structured Filesystem)", "FTL (Flash Translation Layer)", "迁移回调 (Migration Upcall)", "虚拟过度配置 (Virtual Overprovisioning)", "D2FS"],
    "abstract": "In this work, we propose a mechanism to free the log-structured filesystem from running the garbage collection. We exploit the garbage collection functionality of the underlying flash storage to reclaim the invalid sections in the filesystem partition. We call it a Log-structured Filesystem with Device-Driven Garbage Collection, D2FS. D2FS consists of three key ingredients: Coupled Garbage Collection, Migration Upcall, and Virtual Overprovisioning. Coupled Garbage Collection consolidates the valid flash pages at the storage device and remaps the migrated flash pages to new filesystem locations so that the valid pages are clustered not only physically but also logically. Migration Upcall asynchronously notifies the host about the file mappings updated by the Coupled Garbage Collection, minimizing interference with the foreground filesystem operations. Virtual Overprovisioning separates the size of the filesystem partition from the physical capacity of the associated storage partition and sets the size of the filesystem partition larger than the physical storage partition. Virtual overprovisioning ensures that FTL runs the device-level garbage collection on time so that the filesystem partition never runs out of free sections. By integrating these techniques, we save the log-structured filesystem from the garbage collection overhead, a primary obstacle hindering its widespread adoption in production environments. D2FS outperforms F2FS by 3× (FIO), zoned F2FS by 1.7× (FIO), and IPLFS by 1.5× (MySQL YCSB-F)."
}