{
    "id": "b5f8d2a3c1e702024TileLin",
    "title": "TileLink: Generating Efficient Compute-Communication Overlapping Kernels using Tile-Centric Primitives",
    "authors": ["Size Zheng", "Jin Fang", "Xuegui Zheng", "Qi Hou", "Wenlei Bao", "Ningxin Zheng", "Ziheng Jiang", "Dongyang Wang", "Jianxi Ye", "Haibin Lin", "Li-Wen Chang", "Xin Liu"],
    "year": 2024,
    "conference": "arXiv",
    "category": "高性能计算与分布式系统",
    "keywords": ["计算通信重叠 (Compute-Communication Overlapping)", "编译器 (Compiler)", "图块 (Tile)", "并行计算 (Parallel Computing)", "大语言模型 (Large Language Models)", "TileLink", "算子融合 (Kernel Fusion)"],
    "abstract": "Large deep learning models have achieved state-of-the-art performance in a wide range of tasks. These models often necessitate distributed systems for efficient training and inference. The fundamental building blocks for distributed model execution are intra-layer parallel operators. The most effective approach to enhancing the performance of intra-layer parallel operators involves overlapping computation with communication. The overlapping can be achieved through either operator decomposition or kernel fusion. While decomposing operators is straightforward to implement, it often results in suboptimal performance. On the other hand, fusing communication kernels with compute kernels demands significant expertise and is error-prone.\n\nIn this paper, we propose TileLink to enable efficient compilation and generation of overlapped compute-communication kernels. TileLink is composed of frontend and backend. In the frontend, TileLink decouples the design space of communication and computation, linking these two parts via tile-centric primitives. In the backend, TileLink translates these primitives into low-level communication instructions, integrating the communication and computation components to achieve overlapped execution. In experiments, TileLink achieves from 1.17\\u00d7 to 20.76\\u00d7 speedup to non-overlapping baseline and achieves performance comparable to state-of-the-art overlapping libraries on GPUs."
}