{
  "id": "b3c6b9a5e7a9",
  "title": "The Cambridge Report on Database Research",
  "authors": ["Anastasia Ailamaki", "Samuel Madden", "Daniel Abadi", "Gustavo Alonso", "Shiem Amer-Yahia", "Magdalena Balazinska", "Philip A. Bernstein", "Peter Boncz", "Michael Cafarella", "Surajit Chaudhuri", "Susan Davidson", "David DeWitt", "Yanlei Diao", "Xin Luna Dong", "Michael Franklin", "Juliana Freire", "Johannes Gehrke", "Alon Halevy", "Joseph M. Hellerstein", "Mark D. Hill", "Stratos Idreos", "Yannis Ioannidis", "Christoph Koch", "Donald Kossmann", "Tim Kraska", "Arun Kumar", "Guoliang Li", "Volker Markl", "Renee Miller", "C. Mohan", "Thomas Neumann", "Beng Chin Ooi", "Fatma Ozcan", "Aditya Parameswaran", "Ippokratis Pandis", "Jignesh M. Patel", "Andrew Pavlo", "Danica Porobic", "Viktor Sanca", "Michael Stonebraker", "Julia Stoyanovich", "Dan Suciu", "Wang-Chiew Tan", "Shiv Venkataraman", "Matei Zaharia", "Stanley B. Zdonik"],
  "year": 2023,
  "conference": "SIGMOD",
  "category": "数据库系统",
  "keywords": ["数据库研究", "云计算", "大语言模型", "数据治理", "硬件加速", "数据科学", "负责任数据管理"],
  "abstract": "On October 19-20, 2023, the authors of this report convened in Cambridge, MA, to discuss the state of the database research field1, its recent accomplishments and ongoing challenges, and future directions for research and community engagement. This gathering continues a long-standing tradition in the database community, dating back to the late 1980s, in which researchers meet roughly every five years to produce a forward-looking report [1, 2, 3, 4, 5, 6, 7, 8, 9].\nFootnote 1: Broadly defined as the community of researchers publishing in ACM SIGMOD, VLDB, and related conferences, journals, and workshops.\nThis report summarizes the key takeaways from our discussions. We begin with a retrospective on the community's academic, open-source, and commercial successes over the past five years. We then turn to future opportunities, with a focus on core data systems-particularly in the context of cloud computing and emerging hardware-as well as on the growing impact of data science, data governance, and generative AI.\nThis document is not intended as an exhaustive survey of all technical challenges or industry innovations in the field. Rather, it reflects the perspectives of senior community members on the most pressing challenges and promising opportunities ahead."
}