{
    "id": "a7f3e12b9c8d2025OpenOneR",
    "title": "OpenOneRec Technical Report: An Open Foundation Model and Benchmark to Accelerate Generative Recommendation",
    "authors": ["OneRec Team"],
    "year": 2025,
    "conference": "arXiv",
    "category": "推荐系统",
    "keywords": ["生成式推荐", "基础模型", "基准评测", "指令跟随", "跨域迁移", "OpenOneRec", "RecIF-Bench"],
    "abstract": "While the OneRec series has successfully unified the fragmented recommendation pipeline into an end-to-end generative framework, a significant gap remains between recommendation systems and general intelligence. Constrained by isolated data, existing models struggle to leverage the massive data scaling that drives the emergent capabilities of Large Language Models (LLMs). As a result, they operate as domain specialists—proficient in pattern matching but lacking world knowledge, reasoning capabilities, and instruction following. This limitation is further compounded by the lack of a holistic benchmark to evaluate such integrated capabilities. To address this, our contributions are: 1) RecIF-Bench & Open Data: We propose RecIF-Bench, a holistic benchmark covering 8 diverse tasks that thoroughly evaluate capabilities from fundamental prediction to complex reasoning. Concurrently, we release a massive training dataset comprising 96 million interactions from 160,000 users to facilitate reproducible research. 2) Framework & Scaling: To ensure full reproducibility, we open-source our comprehensive training pipeline, encompassing data processing, co-pretraining, and post-training. Leveraging this framework, we demonstrate that recommendation capabilities can scale predictably while mitigating catastrophic forgetting of general knowledge. 3) OneRec-Foundation: We release OneRec-Foundation (1.7B and 8B), a family of models establishing new state-of-the-art (SOTA) results across all tasks in RecIF-Bench. Furthermore, when transferred to the Amazon benchmark, our models surpass the strongest baselines with an average 26.8% improvement in Recall@10 across 10 diverse datasets (Figure 1). This work marks a step towards building truly intelligent recommender systems. Nonetheless, realizing this vision presents significant technical and theoretical challenges, highlighting the need for broader research engagement in this promising direction."
}